tap "homebrew/bundle"
tap "homebrew/services"
tap "kegworks-app/kegworks"
brew "chezmoi"
brew "node"
brew "ollama", restart_service: :changed
brew "zsh"
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-completions"
brew "fzf"
brew "fzf-tab"
brew "zsh-autopair"
brew "zsh-history-substring-search"
brew "zoxide"
brew "lsd"
brew "lazygit"
brew "git-delta"
brew "ripgrep"
brew "bottom"
brew "gdu"
brew "python"
brew "go"
brew "bat"
brew "eth-p/software/bat-extras-batman"
brew "eth-p/software/bat-extras-batgrep"
brew "neovim"
brew "lua"
brew "luarocks"
brew "fd"
brew "rust"
brew "direnv"
brew "zellij"
cask "1password"
cask "1password-cli"
cask "discord"
cask "ghostty"
cask "hammerspoon"
cask "kegworks-app/kegworks/kegworks"
cask "linearmouse"
cask "makemkv"
cask "microsoft-remote-desktop"
cask "moonlight"
cask "parsec"
cask "spotify"
cask "squirrel-app"
cask "telegram"
cask "the-unarchiver"
cask "utm"
cask "xca"
cask "xquartz"
cask "zen"
cask "font-hack-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "claude-code@latest"
